// Вие сте инженери в Галактическата Федерация, която търси ефективен начин за управление на космически кораби. 
// Трябва да създадете програма на C++, която да записва и чете информация за корабите във файл. Всеки кораб има уникално име, 
// максимална скорост и капацитет на горивото. Реализирайте клас Spaceship, който има име, максимална скорост и капацитет на горивото. 
// Класът трябва да има голяма четворка, гетъри и сетъри , както и функции за четене и писане в бинарен файл. Трябва да можем да създаваме
// кораб само с име или с име, максимална скорост и капацитет на гориво. Не може да има създаден кораб, който няма поне име.
// Когато пишем кораба във файл трябва да видим дали вече не съществува, ако съществува само да променим стойностите му. 
// Нека за улеснение да приемем, че имената на корабите са уникални и не можем да ги променяме.
